Revit 2027 API
BuiltInFailures.EditingFailures.CannotEditEditingElements Property
 Can't obtain permission to edit the element: The Central Model is inaccessible and another user is editing the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotEditEditingElements { get; }
Public Shared ReadOnly Property CannotEditEditingElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotEditEditingElements {
	FailureDefinitionId^ get ();
}
static member CannotEditEditingElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace